<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"f8c6a74015a17d11f57472c949076a5d27d051e17a74046398a139f75d9cd840","plan_job_ref":"Job Pull Request Checks #3233 at https://github.com/GSA-TTS/FAC/actions/runs/9702856085","plan_out_hash":"19ec4fd3344f2d26ebbcac260c3f883e249734b1b6f911b2f387c1265d82d6c4","plan_hash":"23022b02f3eca32f86857db871ad2efa2f0d5efa7d1eded57ae48b4d83a45363","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.dev.module.newrelic.newrelic_one_dashboard.log_review_dashboard will be created
+   resource "newrelic_one_dashboard" "log_review_dashboard" {
+       account_id  = (known after apply)
+       guid        = (known after apply)
+       id          = (known after apply)
+       name        = "FAC Log Review (dev)"
+       permalink   = (known after apply)
+       permissions = "public_read_only"

+       page {
+           guid = (known after apply)
+           name = "FAC Log Review"

+           widget_billboard {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Submission Count"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "From Transaction SELECT count(*) as 'Submissions' WHERE appName = 'gsa-fac-dev' and request.method = 'POST' and request.uri like '/audit/submission/%' since 1 week ago"
                }
            }
+           widget_billboard {
+               column         = 4
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Excel Uploads"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT count(*) AS 'Total uploads', average(apm.service.transaction.duration) AS 'Average time (s)' WHERE appName = 'gsa-fac-dev' AND path LIKE 'audit.views.views:ExcelFileHandlerView.post'"
                }
            }
+           widget_billboard {
+               column         = 7
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Single Audit Report Uploads"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT count(*) AS 'Total uploads', average(apm.service.transaction.duration) AS 'Average time (s)' WHERE appName = 'gsa-fac-dev' AND path LIKE 'audit.views.upload_report_view:UploadReportView.post'"
                }
            }
+           widget_billboard {
+               column         = 10
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Global Requests (Non-Upload)"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT count(*) AS 'Total requests', average(apm.service.transaction.duration) * 1000 AS 'Average time (ms)' WHERE appName = 'gsa-fac-dev' AND path NOT LIKE '%ExcelFileHandlerView.post' AND path NOT LIKE '%UploadReportView.post'"
                }
            }
+           widget_billboard {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 6
+               title          = "Infected Files Detected"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) AS 'Infected Files' FROM Log WHERE tags.space_name = 'dev' and message LIKE '%ScanResult.INFECTED%'"
                }
            }
+           widget_billboard {
+               column         = 4
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 6
+               title          = "Django /admin/login/ Count"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(`message` as `/admin/login/ hits`) FROM Log WHERE `message` LIKE 'app.fac.gov%/admin/login%' SINCE 7 days ago"
                }
            }

+           widget_stacked_bar {
+               column         = 1
+               height         = 4
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 3
+               title          = "500 Error Code"
+               width          = 12

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction FACET `request.uri` WHERE response.status = '500' and appName = 'gsa-fac-dev' SINCE 1 week AGO TIMESERIES"
                }
            }
+           widget_stacked_bar {
+               column         = 1
+               height         = 4
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 4
+               title          = "Login Requests"
+               width          = 6

+               colors {
+                   color = "#00ff04"

+                   series_overrides {
+                       color       = "#00ff04"
+                       series_name = "/openid/login/"
                    }
                }

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction FACET `request.uri` WHERE request.uri = '/openid/login/' and appName = 'gsa-fac-dev' SINCE 1 week AGO TIMESERIES"
                }
            }
+           widget_stacked_bar {
+               column         = 1
+               height         = 4
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 5
+               title          = "Logout Requests"
+               width          = 6

+               colors {
+                   color = "#ff0000"

+                   series_overrides {
+                       color       = "#ff0000"
+                       series_name = "/openid/logout/"
                    }
                }

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction FACET `request.uri` WHERE request.uri = '/openid/logout/' and appName = 'gsa-fac-dev' SINCE 1 week AGO TIMESERIES"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.dev-backups-bucket.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/dev-backups-bucket/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 6 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3233](https://github.com/GSA-TTS/FAC/actions/runs/9702856085)